CREATE DEFINER=`root`@`localhost` PROCEDURE `insert_документюл`(
	IN _ID_ДокИП VARCHAR(36),
    IN _ДатаСост VARCHAR(11),
    IN _ДатаВклМСП VARCHAR(11),
    IN _ПризНовМСП TINYINT(1),
    IN _НаимОрг VARCHAR(1000),
    IN _НаимОргСокр VARCHAR(500),
    IN _ИННЮЛ VARCHAR(10),
    IN _Id_СведМН VARCHAR(100))
BEGIN
	INSERT
		INTO документюл
        SET ID_ДокЮЛ = _ID_ДокИП,
			ДатаСост = _ДатаСост,
            ДатаВклМСП = _ДатаВклМСП,
            ПризНовМСП = _ПризНовМСП,
            НаимОрг = _НаимОрг,
            НаимОргСокр = _НаимОргСокр,
            ИННЮЛ = _ИННЮЛ,
            Id_СведМН = _Id_СведМН
        ON DUPLICATE KEY UPDATE
			ДатаСост = _ДатаСост,
            ДатаВклМСП = _ДатаВклМСП,
            ПризНовМСП = _ПризНовМСП,
            НаимОрг = _НаимОрг,
            НаимОргСокр = _НаимОргСокр,
            ИННЮЛ = _ИННЮЛ,
			Id_СведМН = _Id_СведМН;
END